espressif/esp-idf/components/soc/esp32c61/include/soc/gdma_struct.h
/** Type of out_dscr_chn register
 *  Current transmit descriptor address of TX channel 0
 */
typedef union {
    struct {
        /** outlink_dscr_chn : RO; bitpos: [31:0]; default: 0;
         *  Represents the address of the next transmit descriptor y+1 pointed by the current
         *  transmit descriptor that has already been fetched.
         */
        uint32_t outlink_dscr_chn:32;
    };
    uint32_t val;
} gdma_out_dscr_chn_reg_t;

/** Type of out_dscr_bf0_chn register
 *  The last transmit descriptor address of TX channel 0
 */
typedef union {
    struct {
        /** outlink_dscr_bf0_chn : RO; bitpos: [31:0]; default: 0;
         *  Represents the address of the current transmit descriptor y that has already been
         *  fetched.
         */
        uint32_t outlink_dscr_bf0_chn:32;
    };
    uint32_t val;
} gdma_out_dscr_bf0_chn_reg_t;

/** Type of out_dscr_bf1_chn register
 *  The second-to-last transmit descriptor address of TX channel 0
 */
typedef union {
    struct {
        /** outlink_dscr_bf1_chn : RO; bitpos: [31:0]; default: 0;
         *  Represents the address of the previous transmit descriptor y-1 that has already
         *  been fetched.
         */
        uint32_t outlink_dscr_bf1_chn:32;
    };
    uint32_t val;
} gdma_out_dscr_bf1_chn_reg_t;

/** Type of out_done_des_addr_chn register
 *  TX done outlink descriptor address of TX channel 0
 */
typedef union {
    struct {
        /** out_done_des_addr_chn : RO; bitpos: [31:0]; default: 0;
         *  Represents the address of the outlink descriptor when this descriptor is completed.
         */
        uint32_t out_done_des_addr_chn:32;
    };
    uint32_t val;
} gdma_out_done_des_addr_chn_reg_t;


/** Group: Priority Registers */
/** Type of in_pri_chn register
 *  Priority register of RX channel 0
 */
typedef union {
    struct {
        /** rx_pri_chn : R/W; bitpos: [3:0]; default: 0;
         *  Configures the priority of RX channel n.The larger of the value, the higher of the
         *  priority.
         */
        uint32_t rx_pri_chn:4;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} gdma_in_pri_chn_reg_t;

/** Type of out_pri_chn register
 *  Priority register of TX channel 0
 */
typedef union {
    struct {
        /** tx_pri_chn : R/W; bitpos: [3:0]; default: 0;
         *  Configures the priority of TX channel n.The larger of the value, the higher of the
         *  priority.
         */
        uint32_t tx_pri_chn:4;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} gdma_out_pri_chn_reg_t;


/** Group: Peripheral Select Registers */
/** Type of in_peri_sel_chn register
 *  Peripheral selection register of RX channel 0
 */
typedef union {
    struct {
        /** peri_in_sel_chn : R/W; bitpos: [5:0]; default: 63;
         *  Configures the peripheral connected to RX channel n.\\ 0: Dummy\\ 1: SPI2\\ 2:
         *  UHCI0\\ 3: I2S0\\ 4: Dummy\\ 5: Dummy\\ 6: AES\\ 7: SHA\\ 8: ADC_DAC\\ 9: PARL_IO\\
         *  10: Dummy\\ 11~15: Dummy\\
         */
        uint32_t peri_in_sel_chn:6;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} gdma_in_peri_sel_chn_reg_t;

/** Type of out_peri_sel_chn register
 *  Peripheral selection register of TX channel 0
 */
typedef union {
    struct {
        /** peri_out_sel_chn : R/W; bitpos: [5:0]; default: 63;
         *  Configures the peripheral connected to TX channel n.\\ 0: Dummy\\ 1: SPI2\\ 2:
         *  UHCI0\\ 3: I2S0\\ 4: Dummy\\ 5: Dummy\\ 6: AES\\ 7: SHA\\ 8: ADC_DAC\\ 9: PARL_IO\\
         *  10: Dummy\\ 11~15: Dummy\\
         */
        uint32_t peri_out_sel_chn:6;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} gdma_out_peri_sel_chn_reg_t;


typedef struct {
    volatile gdma_in_int_raw_chn_reg_t in_int_raw_ch0;
    volatile gdma_in_int_st_chn_reg_t in_int_st_ch0;
    volatile gdma_in_int_ena_chn_reg_t in_int_ena_ch0;
    volatile gdma_in_int_clr_chn_reg_t in_int_clr_ch0;
    volatile gdma_in_int_raw_chn_reg_t in_int_raw_ch1;
    volatile gdma_in_int_st_chn_reg_t in_int_st_ch1;
    volatile gdma_in_int_ena_chn_reg_t in_int_ena_ch1;
    volatile gdma_in_int_clr_chn_reg_t in_int_clr_ch1;
    uint32_t reserved_020[4];
    volatile gdma_out_int_raw_chn_reg_t out_int_raw_ch0;
    volatile gdma_out_int_st_chn_reg_t out_int_st_ch0;
    volatile gdma_out_int_ena_chn_reg_t out_int_ena_ch0;
    volatile gdma_out_int_clr_chn_reg_t out_int_clr_ch0;
    volatile gdma_out_int_raw_chn_reg_t out_int_raw_ch1;
    volatile gdma_out_int_st_chn_reg_t out_int_st_ch1;
    volatile gdma_out_int_ena_chn_reg_t out_int_ena_ch1;
    volatile gdma_out_int_clr_chn_reg_t out_int_clr_ch1;
    uint32_t reserved_050[4];
    volatile gdma_ahb_test_reg_t ahb_test;
    volatile gdma_misc_conf_reg_t misc_conf;
    volatile gdma_date_reg_t date;
    uint32_t reserved_06c;
    volatile gdma_in_conf0_chn_reg_t in_conf0_ch0;
    volatile gdma_in_conf1_chn_reg_t in_conf1_ch0;
    volatile gdma_infifo_status_chn_reg_t infifo_status_ch0;
    volatile gdma_in_pop_chn_reg_t in_pop_ch0;
    volatile gdma_in_link_chn_reg_t in_link_ch0;
    volatile gdma_in_state_chn_reg_t in_state_ch0;
    volatile gdma_in_suc_eof_des_addr_chn_reg_t in_suc_eof_des_addr_ch0;
    volatile gdma_in_err_eof_des_addr_chn_reg_t in_err_eof_des_addr_ch0;
    volatile gdma_in_dscr_chn_reg_t in_dscr_ch0;
    volatile gdma_in_dscr_bf0_chn_reg_t in_dscr_bf0_ch0;
    volatile gdma_in_dscr_bf1_chn_reg_t in_dscr_bf1_ch0;
    volatile gdma_in_pri_chn_reg_t in_pri_ch0;
    volatile gdma_in_peri_sel_chn_reg_t in_peri_sel_ch0;
    uint32_t reserved_0a4[3];
    volatile gdma_in_done_des_addr_chn_reg_t in_done_des_addr_ch0;
    uint32_t reserved_0b4[7];
    volatile gdma_out_conf0_ch0_reg_t out_conf0_ch0;
    volatile gdma_out_conf1_chn_reg_t out_conf1_ch0;
    volatile gdma_outfifo_status_chn_reg_t outfifo_status_ch0;
    volatile gdma_out_push_chn_reg_t out_push_ch0;
    volatile gdma_out_link_chn_reg_t out_link_ch0;
    volatile gdma_out_state_chn_reg_t out_state_ch0;
    volatile gdma_out_eof_des_addr_chn_reg_t out_eof_des_addr_ch0;
    volatile gdma_out_eof_bfr_des_addr_chn_reg_t out_eof_bfr_des_addr_ch0;
    volatile gdma_out_dscr_chn_reg_t out_dscr_ch0;
    volatile gdma_out_dscr_bf0_chn_reg_t out_dscr_bf0_ch0;
    volatile gdma_out_dscr_bf1_chn_reg_t out_dscr_bf1_ch0;
    volatile gdma_out_pri_chn_reg_t out_pri_ch0;
    volatile gdma_out_peri_sel_chn_reg_t out_peri_sel_ch0;
    uint32_t reserved_104[3];
    volatile gdma_out_done_des_addr_chn_reg_t out_done_des_addr_ch0;
    uint32_t reserved_114[7];
    volatile gdma_in_conf0_chn_reg_t in_conf0_ch1;
    volatile gdma_in_conf1_chn_reg_t in_conf1_ch1;
    volatile gdma_infifo_status_chn_reg_t infifo_status_ch1;
    volatile gdma_in_pop_chn_reg_t in_pop_ch1;
    volatile gdma_in_link_chn_reg_t in_link_ch1;
    volatile gdma_in_state_chn_reg_t in_state_ch1;
    volatile gdma_in_suc_eof_des_addr_chn_reg_t in_suc_eof_des_addr_ch1;
    volatile gdma_in_err_eof_des_addr_chn_reg_t in_err_eof_des_addr_ch1;
    volatile gdma_in_dscr_chn_reg_t in_dscr_ch1;
    volatile gdma_in_dscr_bf0_chn_reg_t in_dscr_bf0_ch1;
    volatile gdma_in_dscr_bf1_chn_reg_t in_dscr_bf1_ch1;
    volatile gdma_in_pri_chn_reg_t in_pri_ch1;
    volatile gdma_in_peri_sel_chn_reg_t in_peri_sel_ch1;
    uint32_t reserved_164[3];
    volatile gdma_in_done_des_addr_chn_reg_t in_done_des_addr_ch1;
    uint32_t reserved_174[7];
    volatile gdma_out_conf0_chn_reg_t out_conf0_ch1;
    volatile gdma_out_conf1_chn_reg_t out_conf1_ch1;
    volatile gdma_outfifo_status_chn_reg_t outfifo_status_ch1;
    volatile gdma_out_push_chn_reg_t out_push_ch1;
    volatile gdma_out_link_chn_reg_t out_link_ch1;
    volatile gdma_out_state_chn_reg_t out_state_ch1;
    volatile gdma_out_eof_des_addr_chn_reg_t out_eof_des_addr_ch1;
    volatile gdma_out_eof_bfr_des_addr_chn_reg_t out_eof_bfr_des_addr_ch1;
    volatile gdma_out_dscr_chn_reg_t out_dscr_ch1;
    volatile gdma_out_dscr_bf0_chn_reg_t out_dscr_bf0_ch1;
    volatile gdma_out_dscr_bf1_chn_reg_t out_dscr_bf1_ch1;
    volatile gdma_out_pri_chn_reg_t out_pri_ch1;
    volatile gdma_out_peri_sel_chn_reg_t out_peri_sel_ch1;
    uint32_t reserved_1c4[3];
    volatile gdma_out_done_des_addr_chn_reg_t out_done_des_addr_ch1;
    uint32_t reserved_1d4[66];
    volatile gdma_tx_ch_arb_weigh_chn_reg_t tx_ch_arb_weigh_ch0;
    volatile gdma_tx_arb_weigh_opt_dir_chn_reg_t tx_arb_weigh_opt_dir_ch0;
    uint32_t reserved_2e4[8];
    volatile gdma_tx_ch_arb_weigh_chn_reg_t tx_ch_arb_weigh_ch1;
    volatile gdma_tx_arb_weigh_opt_dir_chn_reg_t tx_arb_weigh_opt_dir_ch1;
    uint32_t reserved_30c[18];
    volatile gdma_rx_ch_arb_weigh_chn_reg_t rx_ch_arb_weigh_ch0;
    volatile gdma_rx_arb_weigh_opt_dir_chn_reg_t rx_arb_weigh_opt_dir_ch0;
    uint32_t reserved_35c[8];
    volatile gdma_rx_ch_arb_weigh_chn_reg_t rx_ch_arb_weigh_ch1;
    volatile gdma_rx_arb_weigh_opt_dir_chn_reg_t rx_arb_weigh_opt_dir_ch1;
    uint32_t reserved_384[10];
    volatile gdma_in_link_addr_chn_reg_t in_link_addr_chn[2];
    uint32_t reserved_3b4;
    volatile gdma_out_link_addr_chn_reg_t out_link_addr_chn[2];
    uint32_t reserved_3c0;
    volatile gdma_intr_mem_start_addr_reg_t intr_mem_start_addr;
    volatile gdma_intr_mem_end_addr_reg_t intr_mem_end_addr;
    volatile gdma_arb_timeout_tx_reg_t arb_timeout_tx;
    volatile gdma_arb_timeout_rx_reg_t arb_timeout_rx;
    volatile gdma_weight_en_tx_reg_t weight_en_tx;
    volatile gdma_weight_en_rx_reg_t weight_en_rx;
} gdma_dev_t;

extern gdma_dev_t GDMA;

#ifndef __cplusplus
_Static_assert(sizeof(gdma_dev_t) == 0x3dc, "Invalid size of gdma_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
